pendientes/CasosPracticos_RAM.org
#+TITLE: UD06 - RAM - Casos Practicos
#+AUTHOR: Angel Berlanas
#+latex_header: \hypersetup{colorlinks=true,linkcolor=black}

* Casos Hardware
  
** Pitando sin parar

*** American Megatrends

| Sonido                 | Significado                             |   
|------------------------+-----------------------------------------|
| 9 Beeps cortos         | ROM cheksum Error                       |   
| 10 Beeps cortos        | CMOS shutdown register read/write error |   
| 11 Beeps cortos        | Error en la caché                       |   
| 1 Beep largo           | Error de la RAM                         |   
| 1 Beep largo y 1 corto | Error en la placa base o ROM Basic      |   

*** BIOS AWARD 

| Sonido | Significado|
|--------+------------|
|Beeps que se repiten indefinidamente|	Problema con la memoria RAM|

*** DELL e IBM

| Número de Beeps | Mensaje de Error         |
|-----------------+--------------------------|
|                 |                          |
| 1 Beep          | BIOS corrupta            |
| 2 Beep          | Memoria RAM no detectada |
| 3 Beep          | Fallo en la placa base   |
| 4 Beep          | Fallo en la memoria RAM  |


** Soluciones HW

*** Apretar la RAM
*** Cambiarla de SLOT
*** Borrarla para vaciar la estática
*** Cambiar la RAM Modelos similares


* Casos Software

** SO No me detecta toda la RAM

*** Memtest
*** GNU/LinuX Live
*** 32 o 64 Bits

** Herramientas SW

*** GNU/LinuX 

 + ~free~
 + ~swapon~
 + ~top~
 + ~/proc/meminfo~
 + ~uname -m~
 + ~kernel~

*** Windows

~Get-WmiObject win32_physicalmemory~
~|| Format-Table Manufacturer,Banklabel,...~
~Configuredclockspeed,Devicelocator,Capacity,Serialnumber -autosize~




