Unidad06_Memoria/Practicas/CasosPracticos_RAM.tex
% Created 2019-11-12 mar 18:30
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[newfloat]{minted}
\hypersetup{colorlinks=true,linkcolor=black}
\author{Angel Berlanas}
\date{\today}
\title{UD06 - RAM - Casos Practicos}
\hypersetup{
 pdfauthor={Angel Berlanas},
 pdftitle={UD06 - RAM - Casos Practicos},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.2 (Org mode 9.2.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Casos Hardware}
\label{sec:orgdcbd6cc}

\subsection{Pitando sin parar}
\label{sec:orgb413ef2}

\subsubsection{American Megatrends}
\label{sec:org89a2f12}

\begin{center}
\begin{tabular}{ll}
Sonido & Significado\\
\hline
9 Beeps cortos & ROM cheksum Error\\
10 Beeps cortos & CMOS shutdown register read/write error\\
11 Beeps cortos & Error en la caché\\
1 Beep largo & Error de la RAM\\
1 Beep largo y 1 corto & Error en la placa base o ROM Basic\\
\end{tabular}
\end{center}

\subsubsection{BIOS AWARD}
\label{sec:orgb321a35}

\begin{center}
\begin{tabular}{ll}
Sonido & Significado\\
\hline
Beeps que se repiten indefinidamente & Problema con la memoria RAM\\
\end{tabular}
\end{center}


\subsubsection{DELL e IBM}
\label{sec:orgbb7e946}

\begin{center}
\begin{tabular}{ll}
Número de Beeps & Mensaje de Error\\
\hline
 & \\
1 Beep & BIOS corrupta\\
2 Beep & Memoria RAM no detectada\\
3 Beep & Fallo en la placa base\\
4 Beep & Fallo en la memoria RAM\\
\end{tabular}
\end{center}

**


\subsection{Soluciones HW}
\label{sec:org75f6b08}

\subsubsection{Apretar la RAM}
\label{sec:org9db8bf7}
\subsubsection{Cambiarla de SLOT}
\label{sec:org473b274}
\subsubsection{Borrarla para vaciar la estática}
\label{sec:orged1e586}
\subsubsection{Cambiar la RAM Modelos similares}
\label{sec:org659cad6}

\section{Casos Software}
\label{sec:org41fb139}

\subsection{SO No me detecta toda la RAM}
\label{sec:org0868319}

\subsubsection{Memtest}
\label{sec:org35c6c99}
\subsubsection{GNU/LinuX Live}
\label{sec:org3e9463b}
\subsubsection{32 o 64 Bits}
\label{sec:orgb916761}

\subsection{Herramientas SW}
\label{sec:orgced648e}

\subsubsection{GNU/LinuX}
\label{sec:org72d2952}

\begin{itemize}
\item \texttt{free}
\item \texttt{swapon}
\item \texttt{top}
\item \texttt{/proc/meminfo}
\item \texttt{uname -m}
\item \texttt{kernel}
\end{itemize}

\subsubsection{Windows}
\label{sec:org91207af}

\texttt{Get-WmiObject win32\_physicalmemory}
\texttt{|| Format-Table Manufacturer,Banklabel,...}
\texttt{Configuredclockspeed,Devicelocator,Capacity,Serialnumber -autosize}
\end{document}
